#+Include: ../../doc.templates/title-injects.org
#+Include: ../../preamble.org

# C-c C-v C-b to eval all blocks

** DONE Symptomatic Person

#+name: sperson  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=9
library(whisker)
cs <- read.csv2("../../data.out/ft_cases.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]
cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

case <- unname(rowSplit(cs))

f <- "case.org"
template <- readChar(f, file.info(f)$size)
f <- "person.org"
person <- readChar(f, file.info(f)$size)
f <- "symptoms.org"
symptoms <- readChar(f, file.info(f)$size)

text <- whisker.render(template, partials=list(person=person, symptoms=symptoms))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: sperson
:RESULTS:

   /Symptomatic Person[fn:: Person -- 479]/
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Okwong Arase                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots NA \ldots 1992-05-05                                     |
   | Marital State             | NA                                                                          |          |
   | Home Address              | Mohammed Nasiru Mukhtar Close \ldots Yakasai \ldots Dawakin Tofa \ldots Kano                            |          |
   | Phone-1                   | +234-818-4262384 NA                                                                 |          |
   | Phone-2                   | 0805-1207008 mobile                                                                 |          |
   | Occupation                | shoemaker (cobbler)                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | 2015-06-09   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | yes \ldots 38.8        |
   | Lethargy                 | NA                            |
   | Muscle Pain              | yes                          |
   | Headache                 | NA                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | NA                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+

   \medskip



:END:

** DONE Cases of Death

#+name: pdeath  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=12
library(whisker)
cs <- read.csv2("../../data.out/ft_cases.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$DateOfDeathDay==day,]
cs <- cs[!is.na(cs$DateOfDeathDay),]

case <- unname(rowSplit(cs))

f <- "case-death.org"
template <- readChar(f, file.info(f)$size)

text <- whisker.render(template)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: pdeath
:RESULTS:

   /Case of death[fn:: Person -- 479]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Okwong Arase                    |
   | Sex \ldots DoB \ldots Age | male \ldots NA \ldots 1992-05-05 |
   | Date of Death             | 2015-06-12                          |
   |---------------------------+-----------------------------------------------|
   
   \medskip


:END:

